terraform {
  required_providers {
    azurerm = {
      source  = "hashicorp/azurerm"
      version = "4.33.0"
    }
  }
}

provider "azurerm" {
  features {}
  subscription_id = "32bd2260-8449-4526-af4d-a40b9179ba7c"
}

कहानी का नाम: "एक पत्थर का मूल्य"
बहुत समय पहले की बात है। एक छोटा लड़का अपने पिता के साथ पहाड़ों के किनारे एक छोटे-से गाँव में रहता था। एक दिन उसके पिता ने उसे एक चमकता हुआ पत्थर दिया और कहा:

“बेटा, ये पत्थर लेकर शहर जाओ और बाजार में जाकर लोगों से पूछो कि क्या वे इसे खरीदना चाहते हैं। लेकिन ध्यान रखना, इसे बेचना मत, बस कीमत पूछकर वापस आ जाना।”

लड़का पत्थर लेकर शहर गया और पहले एक फलवाले के पास पहुँचा। फलवाले ने पत्थर को देखकर कहा,

“अरे, यह तो अच्छा कागज दबाने वाला है, मैं इसे 10 रुपये में ले लूंगा।”
